# DivideVolumesProfilesGapForWidthSome Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DPartFailures..::..DivideVolumesProfilesGapForWidthSome Property
BuiltInFailures..::..DPartFailures Class See Also
---
Division family cannot be used with the selected division gap for some widths of hosts
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DivideVolumesProfilesGapForWidthSome { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DivideVolumesProfilesGapForWidthSome As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DivideVolumesProfilesGapForWidthSome {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DPartFailures Class
Autodesk.Revit.DB Namespace